run/prescribedU/sShapedFlow/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

y1 -.5;
y2 .5;
ny 1;

vertices
(
    (0 $y1 0)
    (1 $y1 0)
    (1 $y2 0)
    (0 $y2 0)
    (0 $y1 1)
    (1 $y1 1)
    (1 $y2 1)
    (0 $y2 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (400 $ny 400) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    rim
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (0 4 7 3)
            (1 2 6 5)
            (0 3 2 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
